[
  {
    "ID": "sub1",
    "PARTICIPANT": "Sarah Bellatti, bellatti@hawaii.edu, 27, John A. Burns School of Medicine.\nMaya Gunther, mgunther@hawaii.edu, ***, John A. Burns School of Medicine\nCorina Edgington, corinae@hawaii.edu, 29, John A. Burns School of Medicine\nViolet E. Horvath PhD, vhorvath@hawaii.edu, N/A, John A. Burns School of Medicine.\nDee-Ann Carpenter MD FACP; deeannc@hawaii.edu, N/A, John A. Burns School of Medicine.",
    "TITLE": "Survey of Disability Status Among Physicians in Hawaii",
    "DESCRIPTION": "Background: The Americans with Disabilities Act defines an individual who has a disability as “a person who has a physical or mental impairment that substantially limits one or more major life activities.” While 26% of the U.S. population reports having a disability, one study found that only 3.1% of U.S. physicians identify as such. The purpose of this study is to estimate the prevalence of physicians working in Hawaii who self-identify as having a disability, and to assess general attitudes regarding disability in the medical workplace in Hawaii. Methods: We surveyed approximately 3,500 physicians actively working in Hawaii, identified through the Hawaii Physician Workforce Database and at the 2024 Hawaii Physician Workforce Summit. The survey consisted of 17 closed-ended questions (yes/no, scaled, multiple choice) with a space provided for free-text comments. Results: Of the 85 responses, 75 were Doctors of Medicine and 8 were Doctors of Osteopathic Medicine. Most (54.8%) worked in outpatient clinics. The majority identified as cisgender women (52%), Non-hispanic Whites (48%), and physicians who graduated from medical school between 1990-2019 (79%). 48% reported that the medical profession is only slightly inclusive for physicians with disabilities. Only 15% regarded their own workplace as highly inclusive. Sixteen (19%) physicians self-identified as having a disability per the ADA definition. The most commonly reported disabilities were chronic illness (6) and neurodivergence (5). Without accommodations, disability interfered with work significantly (4/16), moderately (3/16), slightly (3/16), and not at all (5/16). Six receive accommodations, and four considered the accommodations significantly adequate and comprehensive. Discussion: There are ongoing issues with representation, accommodations, and the acceptance of physicians with disabilities in Hawaii. Further research is needed to confirm these findings and to identify specific barriers to inclusivity in Hawaii’s medical community. ",
    "LINK": "https://youtu.be/a_GCBMKjX38",
    "IMG": "posters/Submission1 - Poster.png"
  },
 {
   "ID": "sub2",
   "PARTICIPANT": "Kristal Xie\nkristalx@hawaii.edu\nUniversity of Hawaii, John A. Burns School of Medicine\n\nHeather Zimmerman\nhz862000@hawaii.edu\nUniversity of Hawaii, John A. Burns School of Medicine\n\nMasako Matsunaga\nmmatsuna@hawaii.edu\nUniversity of Hawaii, John A. Burns School of Medicine\n\nRobert Martiniano\nrmartiniano@albany.edu\nUniversity at Albany, College of Integrated Health Sciences\n",
   "TITLE": "Characteristics of Inpatients with Melanoma in Hawaii: 2016-2023",
   "DESCRIPTION": "Background: Hawai‘i has higher melanoma rates than the national average, likely due to above-average ultraviolet (UV) index. While mortality and delayed diagnoses among Native Hawaiian and Pacific Islander (NHPI) populations are documented, less is known about community and individual factors contributing to melanoma risk. This study describes the demographic, geographic, and clinical characteristics of inpatients diagnosed with melanoma in Hawai‘i from 2016 to 2024. Methods: Inpatient discharge records from Hawai‘i’s Laulima database (2016–2024) were analyzed. Patients with a principal or secondary melanoma diagnosis (ICD-10 C43x) were identified, using the earliest discharge per patient. Non-residents were excluded. Variables included sex, age, race/ethnicity, insurance, county, and area-level poverty. For principal diagnoses, hospital utilization metrics were described.  Results: Of 409 patients with melanoma-related diagnoses, 67 had melanoma as a principal diagnosis and 342 as secondary diagnosis. This patient population was predominantly male (72%), with 19% identifying as non-white, and a small proportion under 45 years old (3.9%). Over half (54%) lived in Honolulu County, followed by Hawaii County (24%), Maui County (14%), and Kauai County (7.1%). Overall, cases were fairly evenly distributed across income levels, with the highest proportion observed in the second-highest income quartile (Q3), accounting for 30% of cases. The median hospital stay for principal diagnosis cases was 5 days, ranging from 1 to 28 days. 78% of admissions were elective, while the remaining 22% were classified as emergency or urgent cases. The median hospital charges were $43,290, ranging from $4,009–$226,160. Discussion: Melanoma affects diverse populations across Hawai‘i, with varying disease severity. These findings highlight the need for targeted public health efforts and further research on risk factors and healthcare access. ",
   "LINK": "https://youtu.be/qCSU6GkKIbU",
   "IMG": "posters/Melanoma_Hawaii_Workforce_Summit_Poster (1) - Kristal Xie.pptx.svg"
 },
 {
   "ID": "sub3",
   "PARTICIPANT": "Brennan Lee, leebren@hawaii.edu, 27, JABSOM\nMichelle Kimura, mkimura9@hawaii.edu, 27, JABSOM\n",
   "TITLE": "Student-Run Free Clinic Integration into Medical School Curriculum: Impact on Medical Students’ Attitudes Towards the Houseless Before and After Participating In Direct Patient Care",
   "DESCRIPTION": "Background:  The mission of the Hawaii H.O.M.E. (“Houseless Outreach and Medical Education”) Project is to improve access to quality healthcare for individuals in Hawaii experiencing homelessness. In 2021, it was formally integrated into the pre-clinical curriculum as a required clinical skills activity at the John A. Burns School of Medicine (JABSOM). In 2022, JABSOM implemented the nation’s first standardized pre-clinical curriculum for a student-run free clinic. This study assesses the impact of the new curriculum on medical students after working with medically underserved populations such as the houseless community in Hawaii.   Methods: 77 JABSOM students were asked to complete pre-surveys at the start of the school year and post-surveys immediately after completion of the first year. The data collected helped us identify any changes that occurred on student attitudes, knowledge, clinical skills, comfortability, and self-efficacy after direct participation at various clinic sites. Paired t-test compared the survey responses. Statistical analyses were performed with R software version 4.2.0.  Results: 66 out of 77 students completed both pre- and post-surveys. Results illustrated a significant increase in confidence levels on the knowledge of issues faced by the houseless community and the availability of local aid resources (p<0.001). Data also showed a significant increase in skills such as working with other members of the healthcare team, navigating difficult patient interactions, managing patient expectations, and interacting with patients through a trauma-informed care approach (p<0.05).  Discussion: The data showed a significant impact on knowledge, skills, comfortability, and efficacy after direct participation in the clinic. Further evaluation is needed to better understand the strengths, challenges, and limitations of curriculum integration. Future investigation includes expanding the survey to additional cohorts of students, and conducting similar studies with students of other backgrounds to better evaluate the impact on learning.  (299 words)",
   "LINK": "https://youtu.be/_Komkz8QVJA",
   "IMG": "posters/HHWS Poster.pptx - Brennan Lee.png"
 },
 {
   "ID": "sub4",
   "PARTICIPANT": "Katherine Koch 2. Kkoch@hawaii.edu 3. 24, John A. Burns School of Medicine\n",
   "TITLE": "The Young Dancer's Dilemma: A National Epidemiologic Analysis on Pediatric Dance Injury Patterns Presenting to Emergency Departments Stratified by Age and Sex ",
   "DESCRIPTION": "Background:  Dance plays a significant, yet often underrecognized, role in youth physical activity. Annually, 10.4 million children participate in dance, resulting in about 25,000 dance-related emergency department (ED) visits. This study investigates pediatric dance injuries by analyzing affected body regions, diagnoses, and mechanisms, stratified by age and sex. Methods: This descriptive epidemiologic analysis utilized the National Electronic Injury Surveillance System (NEISS) from January 1, 2019, to December 31, 2023. Pediatric patients presenting to the ED for dance-associated injuries were identified. Variables included demographics, body region injured, final diagnosis, and mechanism. Patients were stratified by sex, age (<10 vs. 10-17), and COVID-19 period (2019-2021 vs. 2022- 2023). Statistical analyses included linear regressions, chi-squared tests, and post-hoc residuals (p<0.05). Results: Among 3,600 (NE=93,062) cases, 41.2% occurred during COVID and 58.8% post-COVID. Most frequently injured regions were the knees (20.8%), ankles (15.8%), and head (13.3%). Common diagnoses were sprains/strains (31.4%), fractures (12.3%), and contusions/abrasions (8.0%). Mechanisms of injury included floor impacts (37.0%), ankle rolling (13.5%), and non-contact movements (10.4%). Males sustained more head injuries than females (23.7% vs. 11.5%). Compared to adolescents, children had higher rates of sprains/strains (35.5% vs. 18.3%), knee (26.2% vs. 5.5%) and ankle (17.5% vs. 10.4%) injuries, and were often injured by ankle rolling and non-contact movement (p<0.05).  Discussion: Knee and ankle injuries are common among youth dancers, particularly through floor impacts and non-contact mechanisms. Sprains/strains dominate in children and females, while head injuries and fractures occur more often in males and adolescents. These findings underscore the importance of age- and sex-specific prevention strategies, such as neuromuscular training for younger dancers and fall protocols for adolescents.",
   "LINK": "https://youtu.be/oxErH_i8K6I",
   "IMG": "posters/PedsDance_Poster (3) - Katherine Koch.png"
 },
 {
   "ID": "sub5",
   "PARTICIPANT": "Brandi Mikami, mikamib@hawaii.edu, John A. Burns School of Medicine\n2) Lucia Xiong, lxiong@hawaii.edu, Obstetrics and Gynecology, The Queen's Medical Center\n3) Cable Kronen, kronen@usc.edu, Obstetrics and Gynecology, The Queen's Medical Center\n4) Shandhini Raidoo, raidoo@hawaii.edu, Obstetrics, Gynecology & Women's Health, University of Hawaii\n5) Mary Tschann, mtschann@hawaii.edu, Obstetrics and Gynecology, The Queen's Medical Center\n6) Melissa Natavio, natavio@hawaii.edu, Obstetrics, Gynecology & Women's Health, University of Hawaii\n",
   "TITLE": "Preconception Counseling in the Context of Mental Health: Insights into Knowledge, Attitudes, and Experiences",
   "DESCRIPTION": "Background: Psychiatric comorbidities are a significant contributor to maternal mortality, and individuals with mental health or substance use disorders often face unique challenges when planning for pregnancy. Mental health medications may be contraindicated in pregnancy, but pregnancy itself can also exacerbate mental health conditions, making early counseling and medication planning essential. This study aims to assess prepregnancy counseling experiences, evaluate knowledge of medication and substance safety during pregnancy, and identify gaps in psychiatric involvement in pregnancy planning among pregnancy-capable individuals with mental health or substance use disorders.     Methods: Recruitment flyers were posted in clinics and on social media from September 2021-September 2022. Eligible respondents were female sex, between 18 and 45 years old, could read and write in English, and had a diagnosis of a psychiatric disorder or received continuous psychiatric treatment. Descriptive statistics were used to analyze data.     Results:  We received 98 complete responses. 44 (51.2%) respondents reported psychiatric medication use in the past 6 months. 16 (48.5%) respondents who were prescribed medication discussed possible effects of medication on pregnancy with their provider. 36 (42.9%) were unsure if prescribed psychiatric medications were safe. Of those taking FDA Class D drugs, 6 (46.2%) were unsure if they were safe during pregnancy. 38 (46.9%) received pre-pregnancy counseling from a women’s healthcare provider, and 17 (21%) from a psychiatrist.     Discussion: ​  Medical education should focus on normalizing and improving psychiatric screening as a component of pregnancy planning. Medical trainees should be expected to achieve competence with management of medications, psychological supports, and anticipatory guidance for patients navigating the transition to parenthood. ",
   "LINK": "https://youtu.be/UVHsyyFnTe8",
   "IMG": "posters/Mikami_Brandi_2025_Hawaii_Health_Workforce_Summit_Poster - Brandi Mikami.png"
 },
 {
   "ID": "sub6",
   "PARTICIPANT": "Miranda Eddins\nmkeddins@hawaii.edu\n24, John A. Burns School of Medicine\n2) Hannah Collins-Doijode\ndoijode@hawaii.edu\n24, John A. Burns School of Medicine\n3) Haley Yamamoto\nhaleyny@hawaii.edu\n24, John A. Burns School of Medicine\n4) Shelby Tadaki\ntadakish@hawaii.edu\n23, John A. Burns School of Medicine\n",
   "TITLE": "Characteristics of Opioid-Seeking Encounters at the Ministry of Health Hybrid Wellness Clinic in Palau: A Descriptive Study",
   "DESCRIPTION": "Background: Opioid misuse is a global public health concern, yet there is no published data on its impact on Micronesia, Melanesia, or Polynesia. In Palau, limited health record infrastructure and the absence of a prescription tracking system have hindered opioid surveillance. In 2024, the Palau Ministry of Health established the Hybrid Clinic to centralize opioid administration and improve oversight. This study aims to establish baseline demographic and clinical characteristics of patients seeking opioids at the clinic, providing insight into regional practices and informing potential public health interventions in Palau and similarly underserved island nations. Methods: A retrospective review was conducted on patients presenting to the Hybrid Clinic between December 2024 and April 2025. Extracted data included patient demographics, diagnoses, opioid prescription history, and Transtheoretical Model (TTM) stages of change using motivational scores. Descriptive statistics summarized the findings. Results: Among 711 encounters (91 patients), 73.1% were male and 43.6% aged 50–59. 49.0% of encounters had opioid use disorder (OUD). Other common diagnoses included musculoskeletal pain (23.5%), injuries or amputations (17.9%), and osteoarthritis/spondylosis (6.9%). TTM data was available for 383 encounters: 80.16% were in the Contemplation stage, 11.49% in Precontemplation, 6.27% in Action, and 2.09% in Maintenance or Relapse Prevention. 85.8% of encounters were managing a chronic condition. Discussion: This study offers crucial insight into opioid-related care in Palau. The TTM stages of change findings highlight that while most participants are open to change, few have progressed to active engagement or long-term maintenance. The high prevalence of repeat visits, OUD diagnoses, and contemplative stages of change may indicate underrecognized dependency or inadequate pain management alternatives. These findings highlight urgent need for structured treatment programs, opioid stewardship protocols, improved health record tracking systems, and addiction specialist involvement in Palau and all underserved Pacific Island settings. ",
   "LINK": "https://youtu.be/6K6l26fGpqw",
   "IMG": "posters/AHEC poster.pptx (1) - Miranda Eddins.jpg"
 },
 {
   "ID": "sub7",
   "PARTICIPANT": "Kennedy-Kainoa Tamashiro, MS3 JABSOM; \nQuan Lac, MS3 JABSOM; Yujin Na, MS3 JABSOM\n",
   "TITLE": "Palau: Non-Communicable Disease Off-island Treatment Referrals 2020-2022",
   "DESCRIPTION": "Background: Palau is an island nation in Micronesia designated as a medically underserved country that lacks specialty care such as orthopedics, cardiology, and oncology. Palauans receive specialty care through medical missions from other countries or are referred off-island to surrounding countries by the Palau Medical Referral Program.  Methods: We conducted a descriptive study using Excel with medical referral claims from 2020-2022 provided by the Palau Ministry of Health. Based on the recommendation of the National Referral Committee, our analysis focused on identifying the following statistics: the number of referrals per site, number of referrals per specialty, total and average costs per site, and total and average costs per specialty. We found these statistics for each year and compared these values across the three years. Results: Oncology and cardiology are the two most common types of specialty care being referred off-island and Palau as a whole is spending over 2 million dollars a year on referrals. Since cardiology and oncology are the most referred cases, they are also the costliest for Palau each year.  Discussion: This study provides insight into the current state of medical care in Palau. There is a need for specialty care, specifically cardiology and oncology to reduce the economic burden for Palau. This could be accomplished by increasing the number of medical missions to Palau or having specialists in the country providing care.",
   "LINK": "https://youtu.be/wBk0yT1sUHI",
   "IMG": "posters/Palau Referrals Poster - Kennedy Kainoa Tamashiro.jpg"
 },
 {
   "ID": "sub8",
   "PARTICIPANT": "Miranda Eddins\nmkeddins@hawaii.edu\n24, John A. Burns School of Medicine\n",
   "TITLE": "The Impact of Hawai‘i Houseless Outreach and Medical Education (H.O.M.E.) Project on Access to Specialists and Assessing Barriers to Specialty Care Among Houseless Patients ",
   "DESCRIPTION": "Background: The Hawai‘i Houseless Outreach and Medical Education (H.O.M.E.) Project aims to improve healthcare access for houseless individuals by providing free specialty clinics on O’ahu. Nationally, 32% of houseless adults cannot obtain needed medical, surgical, or specialist care, 41% cannot get eyeglasses, and 21% cannot obtain mental health care[1]. Addressing these disparities, H.O.M.E. offers monthly dermatology, ophthalmology, women’s health, and weekly psychiatry clinics. This study explores H.O.M.E.’s impact on improving access to specialty care for Hawaii’s houseless population and identifies barriers to accessing non-free specialty services.  Methods: An anonymous qualitative survey was administered at H.O.M.E. specialty clinics starting in April 2025. It assessed whether patients would have sought specialist care without access to H.O.M.E. clinics, and if not, why not.  Results:  Since April 2025, H.O.M.E. specialty clinics served 32 patients, most commonly for eye exams (32.3%), medication refills (16.1%), and wound care (12.9%). Of surveyed patients, 47.4% (n=9) indicated they would have sought specialist care elsewhere if not seen at H.O.M.E, while 40% (n=12) would not have. Among those who would not have sought care, key barriers included lack of transportation (n=5), perceived low severity of condition (n=3), cost of care (n=2), lack of a primary care provider to obtain referrals (n=2), and difficulty making an appointment (n=2). Discussion:  Findings highlight H.O.M.E.’s critical role in bridging specialty care gaps for houseless individuals. The identified barriers underscore the need for H.O.M.E. to implement targeted interventions, including transportation support, patient education, and integrating referral protocols. Expanding outreach efforts could further increase patient load and amplify H.O.M.E.’s impact.",
   "LINK": "https://youtu.be/aO8F1kc7wmQ",
   "IMG": "posters/HOME Workforce Summit Poster - Miranda Eddins.png"
 },
 {
   "ID": "sub9",
   "PARTICIPANT": "Kiara Moffitt; kmoffitt@hawaii.edu; 26; John A. Burns School of Medicine\nJewel Ito; jewelito@hawaii.edu; 25; John A. Burns School of Medicine\nJosh Ooka; joshooka@hawaii.edu; 24; John A. Burns School of Medicine\nKristal Xie: kristalx@hawaii.edu; N/A; John A. Burns School of Medicine\n",
   "TITLE": "Exploring Volunteer Motivations and Attitudes: A Pilot Study to Improve Kuakini Geriatric Care’s Volunteer Program",
   "DESCRIPTION": "Background: The evaluation of a volunteer program is essential to identify strengths and improve alignment with volunteer and organizational needs. Thus, understanding volunteer motivations and attitudes helps enhance engagement, satisfaction, and retention. This study used a retrospective pre-post survey to assess volunteers’ experiences at Kuakini Geriatric Care, Inc.  Methods: The volunteer program at Kuakini Health System supports more than 50 departments and services, contributing to the organization’s mission of delivering safe, high-quality care to the community. The volunteer survey was designed to collect demographic information, evaluate volunteer motivations before and during their service, assess satisfaction and perceived barriers, and understand attitudes about program management. The survey was distributed via both email and paper copies, to provide alternatives for response. The survey was given to 83 active volunteers, with 44 completed responses received (53% response rate).  Results: The majority of respondents were retired (91%), female (89%), and identified as Japanese (84%), with an average age of 72 years (range 15 to 85 years). The primary motivations for volunteering included a desire to help others (93%), to gain personal satisfaction or a sense of purpose (80%), to make a positive impact within the community (75%), and to make social connections (61%). While few barriers were reported, respondents indicated that more flexible volunteering hours, opportunities to work with friends or family, and skill-building or training options would increase their likelihood to volunteer. Overall, satisfaction with the volunteer program was high, with 89% expressing that they were very satisfied with program management, and 75% of respondents indicating they were “very likely” to continue volunteering in the future.  Conclusions: The volunteers reported high levels of satisfaction and a positive overall experience. Future efforts should focus on increasing engagement in this demographic and expanding outreach to younger volunteers to promote diversity and sustainability.",
   "LINK": "https://youtu.be/OUUdZpOd9BY",
   "IMG": "posters/HHWS 2025 - Kiara Moffitt.png"
 },
 {
   "ID": "sub10",
   "PARTICIPANT": "Josh Ooka, joshooka@hawaii.edu, Age 24, JABSOM \n2) Jewel Ito, jewelito@hawaii.edu, Age 25, JABSOM \n3) Kiara Moffitt, kmoffitt@hawaii.edu, Age 26, JABSOM\n 4) Kristal Xie, kristalx@hawaii.edu, Age N/A, JABSOM\n",
   "TITLE": "Improving Understanding of Companionship Care: A Pilot Study with Families at Kuakini Care Home",
   "DESCRIPTION": "Background: The knowledge of companionship care and its importance to residents’ health and well-being is often limited among family members. This gap can impact family engagement with and support for their loved one. This pilot study explored the knowledge and attitudes of family members regarding companionship care, using an educational infographic and a retrospective pre-post survey.   Methods: This pilot study was conducted at the Kuakini Care Home, which provides 24-hour assisted living care and access to recreational and leisure activities for seniors in a supervised home-like setting.  Twenty primary family contacts of residents received an infographic on companionship care and were asked to complete a brief retrospective pre-post survey. Nine responses were collected (45% response rate). The infographic provided information on prevalence of loneliness and its effect on health conditions, the benefits of social connection, and the importance and types of family involvement.   Results: After reviewing the infographic on companionship care, 44% of respondents reported feeling confident discussing its impact, compared to 22% prior to viewing it. The respondents’ perception of companionship as “very important” remained stable at 67%, and the reported likelihood of visiting their loved one also remained consistently high at 78%. Overall, 67% of respondents rated the infographic as either “effective” or “very effective.”    Conclusion: Though overall attitudes, such as importance and likelihood of visitation, remained consistent, the infographic appeared effective in improving understanding and confidence in discussing companionship care.",
   "LINK": "https://youtu.be/1dfxUMibkNg",
   "IMG": "posters/Improving Understanding of Compansionship Care - A Pilot Study with Families at Kuakini Home - Josh Ooka.png"
 },
 {
   "ID": "sub11",
   "PARTICIPANT": "Kaelyn Kitazumi, kaelynk@hawaii.edu, John A. Burns School of Medicine, MS2\nKaela Akina-Magnussen, kakinama@hawaii.edu, John A. Burns School of Medicine, MS2\nJan Augustine Aurelio, aurelio9@hawaii.edu, John A. Burns School of Medicine, MS2\nChristian Llantero, cllanter@hawaii.edu, John A. Burns School of Medicine, MS2\nMaya Nishida, mayakn@hawaii.edu, John A. Burns School of Medicine, MS2\nDr. Jimmy Chen, jchen808@hawaii.edu, John A. Burns School of Medicine\n",
   "TITLE": "Improving breast cancer screening rates in Filipina, Native Hawaiian, and Pacific Islander populations in West O‘ahu: A root cause analysis ",
   "DESCRIPTION": "Introduction: Breast cancer is the second leading cause of cancer death in women. Screening mammograms enable earlier detection of breast cancer and thus reduce mortality. Filipina, Native Hawaiian, and Pacific Islanders (NHPI) are disproportionately affected by breast cancer, experiencing both increased prevalence and mortality compared to non-minority populations. This quality improvement project aims to identify root causes of low breast cancer screening rates in the underserved communities in West O’ahu. Methods: A chart review of the electronic medical records of 318 patients covered by HMSA insurance was conducted at a well-established primary care practice in West O’ahu and matched against insurance claims data between May-July 2025. Filipina and NHPI constitute a large portion of this practice. Patients included in this study were: female, 50-74 years of age, and due for breast cancer screening per HMSA records. Patients who met exclusion criteria as stated in HMSA’s 2025 Provider Resource Guide were excluded from this study. The project team also observed the workflows of the primary care team and interviewed local imaging centers and nonprofit organizations which support breast cancer screening. Results: Baseline screening rate was 59%. After chart review, 20 additional patients were found to have completed screening and 1 patient was excluded, increasing the screening rate to 66%.The primary reason patients did not complete their screening mammograms was the absence of a scheduled appointment, despite having been seen in the past 12 months and having an active mammogram order. Further analysis revealed limited mammogram appointments and resources in West O’ahu and challenges with patients scheduling their appointments. Discussion: The root cause analysis suggests that there are many barriers in mammogram scheduling for Filipina and NHPI patients living in West O’ahu, which contributes to lower breast cancer screening rates in these populations. ",
   "LINK": "https://youtu.be/KFGgF-bG6pY",
   "IMG": "posters/2025 HHWS Poster - Kaelyn Kitazumi.pptx.svg"
 },
 {
   "ID": "sub12",
   "PARTICIPANT": "Chanel Hunter; chunter4@hawaii.edu; 24 years old, JABSOM (medical student)",
   "TITLE": "Barriers and Facilitators to Sexual Health Services and Education in Native Hawaiian and Pacific Islander Adolescents and Young Adults",
   "DESCRIPTION": "Sexual and reproductive health (SRH) services and education continues to be inaccessible to many adolescents of Native Hawaiian and Pacific Islander (NHPI) communities. Their experiences in accessing SRH services and education is not well-documented in previous literature. A critical gap remains on how to meet the needs of these communities, including LGBTQ+ individuals, and this contributes to their higher rates of HIV, chlamydia, gonorrhea, syphilis, and teen pregnancies compared to other ethnic groups. Previous studies also failed to make distinctions between NHPI groups with Asian Americans, further masking the disparities between them and in comparison, to other ethnic groups. I aimed to address this issue by conducting a systematic review to identify the current barriers and facilitators to NHPI access to SRH services and education. I searched PubMed, CINAHL, EBSCO, and PsycNET for qualitative and quantitative studies done evaluating different interventions and surveys that identify barriers, facilitators, and implications for future efforts. Barriers to SRH services and education included lack of SRH knowledge, social stigma/discrimination, lack of transportation and insurance, inconvenient clinic hours and locations, and fear of lack of confidentiality. Facilitators included structural and policy reform to provide more inclusive care, flexibility of healthcare services, free/reduced contraceptive cost, intergenerational communication in families, and individual motivation. There is a lack of literature on NHPI LGBTQ+ adolescents. Previous successful interventions targeting NHPI adolescents and young adults included Pono Choices, Wahine Talk, Chlamydia Screening Program, and Project Talanoa. The results showed the need for more interventions and programs targeting healthcare inequities, socioeconomic policies, social norms, and power differentials that negatively impact NHPI adolescents. There is also a need for more studies addressing LGBTQ+ individuals and abortion care. My analysis and recommendation can provide a framework for future interventions that can eliminate disparities in NHPI adolescents and young adults. ",
   "LINK": "https://youtu.be/Jt3weVTHyIg",
   "IMG": "posters/Hawaii Health Workforce Summit Poster.pptx (3) - Chanel Hunter.jpg"
 },
 {
   "ID": "sub13",
   "PARTICIPANT": "Tyler Shimabukuro, tylers20@hawaii.edu, 23, University of Hawaii John A. Burns School of Medicine\n",
   "TITLE": "Geographic Disparities in Sarcoma Diagnosis: A SEER-Based Comparison Between Hawaii and the Mainland",
   "DESCRIPTION": "Background: Sarcomas are rare cancers with variable outcomes, influenced by age, treatment, and stage at diagnosis. Hawaii’s unique demographics and geography, along with reported healthcare access challenges, particularly in rural areas, may impact cancer detection and survival. Prior studies have shown urban–rural disparities in cancer outcomes. This study compares sarcoma stage at presentation and survival in Hawaii versus the mainland U.S. using SEER data. Methods: Data from the SEER Research Plus 22 database were analyzed. Stage at diagnosis was determined using Combined Summary Stage (2004+). Chi-square tests compared Hawaii and mainland cases. Kaplan-Meier methods were used to assess survival. All available soft tissue and bone sarcomas were included. Results: Average incidence of soft tissue and bone sarcomas was 4.0 per 100,000 in the mainland and 4.1 in Hawaii. For bone sarcomas alone, Hawaii’s rate was higher (1.5 vs. 1.1 per 100,000; p=0.009). Metastatic osteosarcoma patients in Hawaii had shorter mean survival (24 vs. 38 months; p=0.04). Metastatic synovial sarcoma showed a similar pattern (22 vs. 47.8 months; p=0.002). Discussion: Hawaii had a slightly higher incidence of bone sarcomas and a greater proportion of osteosarcoma cases diagnosed at a metastatic stage. Shorter survival for metastatic cases suggests possible delays in detection, potentially due to limited access to specialized care or differences in awareness and screening.",
   "LINK": "https://youtu.be/udWFociY66k",
   "IMG": "posters/SEER Poster - Tyler Shimabukuro.png"
 },
 {
   "ID": "sub14",
   "PARTICIPANT": "Christie Izutsu MD, FACP, FASN, cizutsu@hawaii.edu, John A. Burns School of Medicine;\nLiana L. Owen, lowen9@hawaii.edu, 25 John A. Burns School of Medicine;\nSaige R. Fong, saigef@hawaii.edu, 26, John A. Burns School of Medicine;\nHope T. Dang, hoped@hawaii.edu, 25, John A. Burns School of Medicine;\nHelen S. Kwon, hkwon@hawaii.edu, 28, John A. Burns School of Medicine;\nSean M. Choi, choisean@hawaii.edu, 27, John A. Burns School of Medicine;\nNicholas H. Van, nhvan@hawaii.edu, 24, John A. Burns School of Medicine;\n",
   "TITLE": "Disparities in Type 2 Diabetes Mellitus-Related Vascular Complications Among COFA patients: A Retrospective Database Study in a Nephrology Clinic in Oahu, Hawaii",
   "DESCRIPTION": "Compacts of Free Association (COFA) citizens experience disproportionately high rates of type 2 diabetes (T2DM). Unique challenges predispose them to diabetes-related vascular complications, yet prior studies group them with broader ethnic categories, masking key differences. This study disaggregates the data to clarify the incidence rate and risk factors for vascular complications in the COFA population with the goal of promoting health equity.   We conducted a retrospective chart review of patients in a private nephrology practice aged 18 or older diagnosed with T2DM before 8/1/24. COFA patients were identified by ethnicity and preferred language. Native Hawaiians and those with type 1 diabetes were excluded. Data collected included demographics, laboratory values, and vascular complications. Time-to-complication and descriptive statistics for potential risk factors were compared between COFA and other patients.   Of 204 patients, 172 (84.3%) non-COFA and 32 (15.7%) COFA citizens were identified. COFA patients were diagnosed with T2DM at a significantly younger age (mean 43 ± 11 vs. 57 ± 14 years; P<.001) and had higher hemoglobin A1c values (mean 10.13 ± 2.85 vs. 8.30 ± 2.73; P=.023). COFA patients utilized acute care services more frequently, with 10+ hospitalizations in 25% versus 7% of non-COFA, and 4+ emergency department visits in 72% versus 26% (both P<.001). COFA patients experienced significantly shorter times from T2DM diagnosis to onset of end-stage kidney disease (P=.018), initiation of dialysis (P=.0094), diabetic retinopathy (P= .015), below-knee amputation (P=.0016), and peripheral vascular disease (P=.0096).  COFA patients develop T2DM earlier, exhibit poorer glycemic control, and utilize acute care services more frequently compared to non-COFA patients. They progress more rapidly to multiple vascular complications, underscoring the need for early intervention, screening, and targeted management. Further research is needed to understand the drivers of these disparities and improve long-term outcomes for COFA patients.",
   "LINK": "https://youtu.be/l8L4eGvwcQA",
   "IMG": "posters/Hawaii Health Workforce Summit Poster - Hope Dang.jpg"
 },
 {
   "ID": "sub15",
   "PARTICIPANT": "Albert H. W. Jiang (ahwjiang@hawaii.edu; John A. Burns School of Medicine, University of Hawaiʻi at Mānoa)\nChloe V. McCreery (chloemcc@hawaii.edu; John A. Burns School of Medicine, University of Hawaiʻi at Mānoa)\nKai Hirayama (kaihira@hawaii.edu; John A. Burns School of Medicine, University of Hawaiʻi at Mānoa)\nJoshua P. Grube (jgrube20@hawaii.edu; John A. Burns School of Medicine, University of Hawaiʻi at Mānoa)\n",
   "TITLE": "Exploring Physician Engagement in Professional Medical Organizations: Insights from JABSOM-Associated Doctors",
   "DESCRIPTION": "Background: National and local professional medical organizations such as the American Medical Association (AMA) and Hawaii Medical Association (HMA) are designed to help support physicians through continuing education, advocacy, career development, and networking. However, with rising membership costs and competing demands, many physicians question their value.  Methods: We surveyed physicians affiliated with the University of Hawai‘i John A. Burns School of Medicine (JABSOM) to explore membership patterns, perceived value, and recommendations for optimal timing of medical organization involvement. Results: Among 66 respondents, 93.9% reported membership in at least one specialty-specific society. However, membership in broader organizations was lower: only 24.2% are current AMA members, while 43.9% are former members and 30.3% have never joined. For local organizations like the Hawai‘i Medical Association (HMA), 16.7% are current members, and 50.6% have never joined. Over half (53%) were unfamiliar with the Honolulu County Medical Society. Top reasons for joining included staying updated on best practices (65.9%), CME access (61.4%), journal access (54.5%), and networking (54.5%). Key barriers were annual dues (78%) and philosophical differences (34%). Most recommended joining specialty organizations during residency (65.2%) or as early as medical school (48.5%). Discussion: Physicians valued specialty societies for mentorship, advocacy, and career support, but cited cost, perceived exclusivity, and limited local relevance as barriers to broader medical organization engagement. These findings highlight opportunities for organizations to: reassess membership fee structures and offer tiered or early-career discounts; strengthen local advocacy and community relevance; and foster more inclusive, mission-aligned environments.  For trainees, early involvement in specialty organizations may maximize networking, mentorship, skill development, and career support — potentially improving long-term career satisfaction and advocacy engagement. Understanding these dynamics can help organizations improve accessibility, relevance, and physician engagement, particularly in Hawai‘i’s uniquely challenging and shifting healthcare landscape.",
   "LINK": "https://youtu.be/F7mMNSGUmFQ",
   "IMG": "posters/Jiang-etal_Hawaii Health Workforce Summit - Albert Jiang.png"
 },
 {
   "ID": "sub16",
   "PARTICIPANT": "Nicholas Van, 24; nhvan@hawaii.edu; JABSOM\nSelena Vanapruks, 27; selenalv@hawaii.edu; JABSOM\nDavid Coleman, 30; dwc432@hawaii.edu; JABSOM\n",
   "TITLE": "Trends and Predictors of Methamphetamine Use in Patients with Congestive Heart Failure: A Retrospective Review of Pali Momi Medical Center Emergency Department Visits",
   "DESCRIPTION": "Background: Methamphetamine (MA) use is linked with congestive heart failure (CHF) and is a growing public health crisis in Hawai‘i, where usage surpasses national averages. There are limited data on MA-associated CHF (MAC) in Hawai‘i.   Method: We performed a retrospective chart review assessing MA use in a random sample of 2,400 patients with CHF who presented to Pali Momi Emergency Department (ED) between January 2013 and December 2022. Each chart was examined for history of MA use, presence of drug screen (UDS), and an official MA use diagnosis. Data were analyzed using descriptive statistics and Chi-square. Logistic regression was used to calculate odds ratios (OR) for associations between MA use and independent variables.   Results: 1,384 (57.5%) males and 1,016 (42.33%) females were identified, with mean age of 66.12 years. ED visits peaked in the sixth decade for males and eighth for females. Overall, 22.3% had a history of MA use. UDS was ordered in 40.1% of charts, of which 36.2% were MA-positive. UDS rates declined with increasing age. MA use prevalence increased from 20.3% in 2013 to 26.0% in 2022, corresponding with UDS ordering rising from 32.4% to 47.2%. Asians were older (median 74 years [IQR 60-85]) than Native Hawaiians and Pacific Islanders (NHPI) (median 58 years [IQR 48-68]). Compared to Asians, NHPI were more likely to use MA (OR 2.54; 95% CI 2.05-3.14).  Discussion: Both MA use prevalence and screening increased over 10 years, suggesting that current practices may miss MAC cases. Age was the most significant risk factor for MAC. NHPI presented with CHF at younger ages and were most likely to exhibit MA use. These findings may improve MAC detection in acute care settings and inform targeted interventions. ",
   "LINK": "https://youtu.be/Phw3mTgNsxg",
   "IMG": "posters/Hawai_i Health Workforce Poster - Nicholas Van.png"
 },
 {
   "ID": "sub17",
   "PARTICIPANT": "Titan Z. Alexio, talexio@hawaii.edu, 23 JABSOM. \nJackson Underhill, junderhi@hawaii.edu, 23 JABSOM.\n",
   "TITLE": "Early Adolescent Elbow Predominance and Late Adolescent Shoulder Shift: A 20-Year National Analysis of Throwing-Related Arm Injuries in Youth Baseball (2005-2025)",
   "DESCRIPTION": "Background: Throwing is a fundamental part of baseball, but it places repetitive stress on the upper extremity. This study evaluates the epidemiology of throwing-related upper extremity injuries in pediatric baseball players and identifies anatomical and age-related patterns over a 20-year period.  Methods: A retrospective analysis of the National Electronic Injury Surveillance System (NEISS) was conducted from 2005 to 2025. Pediatric baseball players (<18 years) with injuries attributed to throwing were identified through narrative keyword filtering (e.g., “throw,” “pitch,” “threw”). Injuries were stratified by body region (shoulder, elbow, forearm, wrist) and four age groups: child (3-10), early adolescent (11-13), middle adolescent (14-16), and late adolescent (17). National estimates were calculated using NEISS weighting. Diagnosis types and emergency department disposition were also analyzed.  Results:  1,166 throwing-related cases were identified after applying an exclusion criteria. Across all ages, sprains/strains (48.7%), fractures (15.7%), and dislocations (2.9%) were most common. The elbow (46.4%), shoulder (36.4%), and upper arm (7.2%) were the most frequently injured body parts. Early adolescents had the highest proportion of elbow injuries (53.4%) and fractures (18.2%) and were 1.3 times more likely to sustain elbow injuries (OR: 1.324, 95% CI: 1.041–1.683, p=0.022) than other age groups. Late adolescents experienced more shoulder injuries (57.9%, p<0.001) and dislocations (9.8%, p=0.006) and were 2.6 times more likely to sustain shoulder injuries (OR: 2.602, 95% CI: 1.737–3.897, p<0.001) and 3.5 times more likely to sustain dislocations (OR: 3.550, 95% CI: 1.623–7.764, p<0.001).  Discussion: Throwing-related upper extremity injuries in youth baseball vary by injury location, severity, and age groups. These findings support age-specific prevention strategies, including pitch count limits, strength programs, and education on throwing mechanics.",
   "LINK": "https://youtu.be/QAc6wdZSJiI",
   "IMG": "posters/Baseball Hawaii Workforce Poster - Titan Alexio.png"
 }
]
