[
 {
   "TITLE": "Healed Healers Heal",
   "START": "8:30 AM",
   "END": "10:00 AM",
   "SPEAKER": "Donald Warne",
   "TRACK": "All",
   "LOCATION": "MEB 102",
   "DESCRIPTION": ""
 },
 {
   "TITLE": "Networking Break",
   "START": "10:00 AM",
   "END": "10:30 AM",
   "SPEAKER": "",
   "TRACK": "",
   "LOCATION": "",
   "DESCRIPTION": ""
 },
 {
   "TITLE": "Want to Retire, Want to Take Over a Practice - Practice Matchmaking 101",
   "START": "10:30 AM",
   "END": "11:30 AM",
   "SPEAKER": "Kellie Wo & Kelley Withy",
   "TRACK": "HEALTHCARE PRACTICE TRACK",
   "LOCATION": "MEB 304",
   "DESCRIPTION": "Are you thinking about retiring? Are you on the other end of the career pathway\n and interested in starting a private practice? This session will be a discussion of\n how both can happen easily. Let’s match you up to make life better for both of you!\n \n \n Also, to be discussed will be best financial ideas for other ends of the career\n spectrum."
 },
 {
   "TITLE": "Community Oral Health Needs Assessment and Environmental Scan",
   "START": "10:30 AM",
   "END": "11:30 AM",
   "SPEAKER": "Patrick Donnelly",
   "TRACK": "RURAL HEALTH TRACK",
   "LOCATION": "MEB 314",
   "DESCRIPTION": "Overview of the Community Oral Health Needs Assessment and Environmental Scan\n conducted by Hawaii Public Health Institute from 2023 to 2025. Topics covered include:\n development and process of the assessment, key findings, and next steps."
 },
 {
   "TITLE": "Community Assessment for Public Health Emergency Response as an Assessment Tool for Rural Health Needs",
   "START": "10:30 AM",
   "END": "11:30 AM",
   "SPEAKER": "Lauren Guest",
   "TRACK": "RURAL HEALTH TRACK",
   "LOCATION": "MEB 314",
   "DESCRIPTION": "CASPER (Community Assessment for Public Health Emergency Response) is a type of\n rapid health needs assessment developed by CDC. Although designed for use post-\n disaster, it has many potential applications that make it a strong rural health assessment\n tool. This presentation will focus on various types of health and well-being data that can\n be collected through CASPER assessments and used to inform clinical practice work."
 },
 {
   "TITLE": "Teaching the Value of Culturally Safe Care – Why Does it Matter",
   "START": "10:30 AM",
   "END": "11:30 AM",
   "SPEAKER": "Jordan Lewis",
   "TRACK": "PUBLIC HEALTH/GERIATRICS TRACK",
   "LOCATION": "MEB 315",
   "DESCRIPTION": "With the global population becoming more diverse, it is important we train a health\n workforce comfortable working with people who may have values, practices, and beliefs\n different from our own. There is a continuum of cultural competence and cultural humility\n and this presentation will provide an overview of the basics on cultural humility and cultural\n competence, and the importance of integrating culture into care, the impact of these\n practices on health and wellbeing. You will also hear about a care facility in the Arctic who\n has led the effort on integrating culture into care and this session will conclude with some\n recommendations on how you can make small, sustainable changes to honor cultural values\n and practices to improve quality of life for patients and health care workers."
 },
 {
   "TITLE": "Innovative Recovery Approaches – Peer Support and Young Adult Outreach at AMHD Clubhouses",
   "START": "10:30 AM",
   "END": "11:30 AM",
   "SPEAKER": "Benjamin Davis, Richalle Patague & Troy Freitas",
   "TRACK": "MENTAL HEALTH TRACK",
   "LOCATION": "MEB 301",
   "DESCRIPTION": "The session explores two innovative and distinct initiatives that expand access to recovery-\n oriented support within the DOH Adult Mental Health Division Clubhouses. First, Forensic\n Peer Specialists integrate trauma-informed mentorship and reentry support, helping justice-\n involved individuals navigate behavioral health recovery. Second, outreach teams target\n young adults with Serious Mental Illness (SMI), focusing on early engagement, peer support,\n and developmentally appropriate services that bridge the transition into adulthood. Panelists\n will share implementation strategies, real-world lessons, and the impact of these services on\n engagement, empowerment, and community reintegration. Additionally, Hawaii is leading\n efforts to standardize a Peer Specialist framework statewide."
 },
 {
   "TITLE": "Coordinating Statewide Efforts – Workforce and Service Delivery",
   "START": "10:30 AM",
   "END": "11:30 AM",
   "SPEAKER": "Angela Bolan & Maisha Amare-Herrera",
   "TRACK": "SUBSTANCE USE TRACK",
   "LOCATION": "MEB 102",
   "DESCRIPTION": ""
 },
 {
   "TITLE": "A Coordinated Approach to Behavioral Healthcare in Hawaii",
   "START": "10:30 AM",
   "END": "11:30 AM",
   "SPEAKER": "Sasha Farmer, Nalu Dias & Sherrie Freitas",
   "TRACK": "SUBSTANCE USE TRACK",
   "LOCATION": "MEB 102",
   "DESCRIPTION": ""
 },
 {
   "TITLE": "Lunch and Networking Break",
   "START": "11:30 AM",
   "END": "12:00 PM",
   "SPEAKER": "",
   "TRACK": "",
   "LOCATION": "Big Tent",
   "DESCRIPTION": ""
 },
 {
   "TITLE": "Breaking Barriers – Collaborating for a Sustainable Physician Workforce in Hawai‘i",
   "START": "12:00 PM",
   "END": "1:30 PM",
   "SPEAKER": "Hawai‘i State Rep. Gregg Takayama, Mark Mugiishi, Ray Vara & Jason Chang Moderator: Nadine Tenn Salle",
   "TRACK": "All",
   "LOCATION": "MEB 102",
   "DESCRIPTION": ""
 },
 {
   "TITLE": "Networking Break and Poster Ratings",
   "START": "1:30 PM",
   "END": "2:00 PM",
   "SPEAKER": "",
   "TRACK": "",
   "LOCATION": "Library, 1st floor",
   "DESCRIPTION": ""
 },
 {
   "TITLE": "Physician Leadership in Healthcare Improves Bargaining Power and the Bottom Line",
   "START": "2:00 PM",
   "END": "3:15 PM",
   "SPEAKER": "Jack Lewin, Geoff Teed & Greg Daniel",
   "TRACK": "HEALTHCARE PRACTICE TRACK",
   "LOCATION": "MEB 102",
   "DESCRIPTION": ""
 },
 {
   "TITLE": "Hawaii Island Street Medicine Outreach",
   "START": "2:00 PM",
   "END": "3:15 PM",
   "SPEAKER": "Lauren Whittemore",
   "TRACK": "RURAL HEALTH TRACK",
   "LOCATION": "MEB 314",
   "DESCRIPTION": "Hawai‘i Island Community Health Center’s Street Medicine Outreach program brings\n essential healthcare directly to people experiencing homelessness and those living in\n remote areas of the Big Island. By navigating geographic isolation, transportation barriers,\n and dispersed encampments, our multidisciplinary teams—nurses, patient navigators, and\n mobile health units—deliver accessible, relationship-based care in the field. This model not\n only addresses urgent medical needs but also builds long-term trust, connects patients to\n resources, reduces avoidable hospital visits, and promotes overall public health, advancing\n health equity for our island community."
 },
 {
   "TITLE": "Unsung Heroes in Healthcare - Community Health Workers",
   "START": "2:00 PM",
   "END": "3:15 PM",
   "SPEAKER": "Kathleen Kozak",
   "TRACK": "RURAL HEALTH TRACK",
   "LOCATION": "MEB 314",
   "DESCRIPTION": "This session will discuss a comparative analysis of the team based approach in\n Costa Rica to the current workforce of community health workers in Hawaii, and\n describe some of the different aspects of their vital work in improving the health of\n our communities across the islands."
 },
 {
   "TITLE": "How to Reduce Hospitalization in Rural Communities for People Living with Dementia",
   "START": "2:00 PM",
   "END": "3:15 PM",
   "SPEAKER": "Dorothy Colby & Jen Cox",
   "TRACK": "RURAL HEALTH TRACK",
   "LOCATION": "MEB 314",
   "DESCRIPTION": "No one enjoys going to the emergency room; and for someone experiencing brain change, it\n can be an even more disorienting and disturbing experience. Unfortunately, the data shows\n that having a diagnosis of dementia correlates with an increased likelihood of going to the ER.\n ​So what can we do to reduce ER visits and hospitalizations when dementia is in the picture?\n Join Jen Cox and Dorothy Colby for a discussion on relationship-based dementia care, where\n we consider the challenging situations that may lead to an emergency room visit, and how we\n can adapt our approach as care partners to identify a person's unmet needs early enough to\n avoid higher-level interventions such as hospitalization and other costly options that may\n not be readily available in our rural communities."
 },
 {
   "TITLE": "Indigenous Determinants of Health and Cultural Approaches to Wellbeing",
   "START": "2:00 PM",
   "END": "3:15 PM",
   "SPEAKER": "Donald Warne",
   "TRACK": "PUBLIC HEALTH/GERIATRICS TRACK",
   "LOCATION": "MEB 315",
   "DESCRIPTION": "Social determinants of health typically focus on poor social conditions that can result in\n health disparities, including poverty, inadequate housing, and low educational\n attainment. The Indigenous Determinants of Health Working Group (IDHWG) was formed\n in April 2023 to increase visibility and awareness of the health and wellbeing of\n Indigenous Peoples to United Nations member states and entities. As a member of the\n IDHWG, Dr. Warne (Oglala Lakota) will discuss the renewed focus on cultural strengths and\n perspectives that can promote wellness and community health, including the Indigenous\n Planetary Health, sustainable Indigenous food systems, land and water protections, and\n the use of Indigenous traditional medicines."
 },
 {
   "TITLE": "Innovative Mental Health Models – How to Build an Ecosystem of Engagement",
   "START": "2:00 PM",
   "END": "3:15 PM",
   "SPEAKER": "Haylin Dennison, Matt Lew, Zee Tin & Matt Strombach",
   "TRACK": "MENTAL HEALTH TRACK",
   "LOCATION": "MEB 301",
   "DESCRIPTION": "This session explores how community-driven, culturally responsive, and youth-centered\n models can transform mental health care. Drawing from the work of Spill The Tea Café,\n presenters will highlight strategies for engaging marginalized youth, building sustainable\n social enterprises, and addressing provider burnout through collaborative care and\n workforce development. Participants will leave with practical insights into creating\n ecosystems that center trust, connection, and long-term impact."
 },
 {
   "TITLE": "Behavioral Health Prevention Efforts Across the Islands",
   "START": "2:00 PM",
   "END": "3:15 PM",
   "SPEAKER": "Rick Collins & Michael Miranda",
   "TRACK": "SUBSTANCE USE TRACK",
   "LOCATION": "MEB 102",
   "DESCRIPTION": ""
 },
 {
   "TITLE": "Networking Break and Poster Ratings",
   "START": "3:15 PM",
   "END": "3:45 PM",
   "SPEAKER": "",
   "TRACK": "",
   "LOCATION": "Library, 1st floor",
   "DESCRIPTION": ""
 },
 {
   "TITLE": "Synergy – Recommended Actions and Exemplars of Interprofessional Practice",
   "START": "3:45 PM",
   "END": "5:00 PM",
   "SPEAKER": "Laura Reichhardt, Jared Medeiros, Derek Ching, Sarah Racsa, Landon Opunui & Bradley Kuo",
   "TRACK": "HEALTHCARE PRACTICE TRACK",
   "LOCATION": "MEB 102",
   "DESCRIPTION": "This panel shares the recommendations of the Interprofessional Models of Care taskforce\n and shares thriving interprofessional practice models across the state."
 },
 {
   "TITLE": "Transportation Study and Programs Update",
   "START": "3:45 PM",
   "END": "5:00 PM",
   "SPEAKER": "Aimee Grace",
   "TRACK": "RURAL HEALTH TRACK",
   "LOCATION": "MEB 314",
   "DESCRIPTION": "The University of Hawai‘i (UH) Rural Health Research and Policy Center\n (RHRPC) was established in 2022 to translate community health needs into\n policy solutions. This session will present an update of UH RHRPC's work,\n including projects to address Hawaii's health workforce challenges in the\n areas of Medicare reimbursement, Health Professional Shortage Area (HPSA)\n scoring, health policy landscapes in Hawai'i and the Pacific, and a recent\n transportation project to address travel access needs in Hawai'i's rural\n communities."
 },
 {
   "TITLE": "Public Health Workforce – Supporting Our Communities Now and in the Future",
   "START": "3:45 PM",
   "END": "5:00 PM",
   "SPEAKER": "Taylor Rodgers, Scott Murakami & Rosilyn Filemoni",
   "TRACK": "PUBLIC HEALTH/GERIATRICS TRACK",
   "LOCATION": "MEB 315",
   "DESCRIPTION": "Public health is fundamental to ensuring the wellbeing and health of a society. In Hawai‘i,\n as with the nation, we have large vacancies in our public health workforce. This public\n health session includes a panel titled, \"The Public Health Workforce: Supporting Our\n Communities Now and in the Future,\" where panelists speak to the current state of our\n workforce and future visions and strategies for it. The panel speakers represent sectors\n from the community/non-profit, academic, and governmental public health."
 },
 {
   "TITLE": "Direct-to-Consumer and Family-Friendly Resources on Evidence-Based Treatments for All Major Youth Mental Health Problem Areas",
   "START": "3:45 PM",
   "END": "5:00 PM",
   "SPEAKER": "Brad Nakamura",
   "TRACK": "MENTAL HEALTH TRACK",
   "LOCATION": "MEB 301",
   "DESCRIPTION": "This presentation aims to accomplish three objectives, and will help its audience members\n to: (1) Utilize a family-friendly and free website (helpyourkeiki.com) for identifying evidence-\n based practices for common types of youth mental health problems (e.g., anxiety,\n depression, trauma, inattention/hyperactivity, disruptive behavior); (2) Increase their\n knowledge of treatment referral information and help families find free or affordable\n therapy; and (3) Identify free web-based treatment strategies to share with youth and\n families with mental health concerns."
 },
 {
   "TITLE": "Behavioral Health Across Cultures",
   "START": "3:45 PM",
   "END": "5:00 PM",
   "SPEAKER": "Sione Tafuna, Kelsie Okamura & Paloma Almanza",
   "TRACK": "SUBSTANCE USE TRACK",
   "LOCATION": "MEB 102",
   "DESCRIPTION": ""
 }
]